DinethraDivanjana2001/TechBots-STM-based-Bot-Working/STM32 firmware/SLRC ROBOT/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "TPS55288.h"
#include "stm32f4xx_hal.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim9;

UART_HandleTypeDef huart4;

/* USER CODE BEGIN PV */
//TPS55288 BuckBoost;
volatile uint32_t millis_counter = 0;
HAL_StatusTypeDef result;
HAL_StatusTypeDef result1;
HAL_StatusTypeDef result2;
HAL_StatusTypeDef IDR_Result;
uint8_t errors = 0;
uint8_t array_no = 0;
int pid_sum = 0;
float pid_sum1 = 0;
uint8_t I2C_Address = 0;
uint8_t TX_Buffer [] = "A" ; // DATA to send
ADC_ChannelConfTypeDef adc1ConfigPrivate = {0};
ADC_ChannelConfTypeDef adc2ConfigPrivate = {0};


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM9_Init(void);
static void MX_UART4_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC2_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM6_Init(void);
/* USER CODE BEGIN PFP */
void motor(int motor,int direction);
void speed(int Left, int Right);
void updateIR();
void calibrate();
void FR_Array_Mux_In_Select(int IR_LED_Num);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#define TCS3472_ADDRESS 0x29 // I2C address of the TCS3472 device

#define left 0
#define right 1

#define Forward 1
#define Backward -1

#define RR_MOTOR_PWM TIM_CHANNEL_1
#define FR_MOTOR_PWM TIM_CHANNEL_2

#define IR_ARRAY_LENGTH 25

int IR_array[IR_ARRAY_LENGTH] = {0};

int digital_IR[IR_ARRAY_LENGTH] = {0};

int Ir_thresholds[IR_ARRAY_LENGTH] = {2099,1840,2816,2021,1767,1914,1878,1757,2099,1840,2816,2021,1767,1914,1878,1757,2099,1840,2816,2021,1767,1914,1878,1757,1800};

uint8_t FR_IR_LED_ARR[25][5] = {
	{0,0,0,0,0},//Y0 IR1
	{0,0,0,0,1},//Y1 IR2
	{0,0,0,1,0},//Y2 IR3
	{0,0,0,1,1},//Y3 IR4
	{0,0,1,0,0},//Y4 IR5
	{0,0,1,0,1},//Y5 IR6
	{0,0,1,1,0},//Y6 IR7
	{0,0,1,1,1},//Y7 IR8
	{0,1,1,1,1},//Y15 IR9
	{0,1,1,1,0},//Y14 IR10
	{0,1,1,0,1},//Y13 IR11
	{0,1,1,0,0},//Y12 IR12
	{0,1,0,1,1},//Y11 IR13
	{0,1,0,1,0},//Y10 IR14
	{0,1,0,0,1},//Y9 IR15
	{0,1,0,0,0},//Y8 IR16
	{1,0,0,0,0},//Y0 IR17
	{1,0,0,0,1},//Y1 IR18
	{1,0,0,1,0},//Y2 IR19
	{1,0,0,1,1},//Y3 IR20
	{1,0,1,0,0},//Y4 IR21
	{1,0,1,0,1},//Y5 IR22
	{1,0,1,1,0},//Y6 IR23
	{1,0,1,1,1},//Y7 IR24
	{1,1,0,0,0}};//Y8 IR25

// PID parameters for Line Following
double Kp = 0.02;
double Ki = 11;
double Kd = 0.1;


int Drive_constant = 500;

// Initialize PID variables
double prevError = 0;
double integral = 0;
double derivative = 0;
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */


  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_I2C2_Init();
  MX_TIM1_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_TIM8_Init();
  MX_TIM9_Init();
  MX_UART4_Init();
  MX_SPI1_Init();
  MX_ADC2_Init();
  MX_TIM2_Init();
  MX_TIM6_Init();
  /* USER CODE BEGIN 2 */

  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_Base_Start_IT(&htim3);


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */


//	  result =HAL_I2C_Mem_Write(&hi2c2,TPS55288_I2C_ADDR,command,1,&config, 1 ,10); //Sending in Blocking mode
 // for the return value from HAL function calls
//	  result =HAL_I2C_Mem_Write(&hi2c2, (E0 << 1), 0x06, I2C_MEMADD_SIZE_8BIT, 0xA0, 1, 10);
//
//
//	  if(result == HAL_ERROR){
//		  errors=errors+1;
//
//	  }
//	  if(result1 == HAL_ERROR){
//		  errors=errors+1;
//
//	  }
//	  if(result2 == HAL_ERROR){
//		  errors=errors+1;
//
//	  }



//		  HAL_GPIO_WritePin(CLR_LED_3_GPIO_Port, CLR_LED_3_Pin, GPIO_PIN_RESET);



	  /* USER CODE END WHILE */

