DinethraDivanjana2001/TechBots-STM-based-Bot-Working/STM32 firmware/SLRC ROBOT/Core/Src/main.c
	  /* USER CODE BEGIN 3 */

//	 for(uint8_t counter = 0 ; counter < 255; counter++){
//
//	 IDR_Result = HAL_I2C_IsDeviceReady(&hi2c2, (0x70 << 1), 3, 10);
////
//	 if(IDR_Result == HAL_OK){
//
//	 I2C_Address = I2C_Address+1;
//
////	 HAL_GPIO_TogglePin(GPIOG, GPIO_PIN_14);
//
//	 }

//	 }

//	 HAL_GPIO_TogglePin(GPIOG, GPIO_PIN_13);

//	 HAL_Delay(500);


//	  result1 =HAL_I2C_Mem_Write( &hi2c2, TPS55288_I2C_ADDR, TPS55288_VOUT_FS, I2C_MEMADD_SIZE_8BIT, 0x83, 1, HAL_MAX_DELAY);

//	  result1 =HAL_I2C_Mem_Write( &hi2c2, TPS55288_I2C_ADDR, TPS55288_IOUT_LIMIT, I2C_MEMADD_SIZE_8BIT, 0x64, 1, HAL_MAX_DELAY);

//		result = HAL_I2C_IsDeviceReady( &hi2c2, 0x74<<1, 10, 1000 );
//	  HAL_Delay(100);
//	  HAL_GPIO_WritePin(FR_ARRAY_EVEN_GPIO_Port, FR_ARRAY_EVEN_Pin, GPIO_PIN_SET);
//	  HAL_GPIO_WritePin(FR_ARRAY_ODD_GPIO_Port, FR_ARRAY_ODD_Pin, GPIO_PIN_RESET);
//	  HAL_Delay(1500);
//	  HAL_GPIO_WritePin(FR_ARRAY_ODD_GPIO_Port, FR_ARRAY_ODD_Pin, GPIO_PIN_SET);
//	  HAL_GPIO_WritePin(FR_ARRAY_EVEN_GPIO_Port, FR_ARRAY_EVEN_Pin, GPIO_PIN_RESET);
//	  HAL_Delay(1500);

//	 	  motor(left, Backward);
//	 	  motor(right, Backward);

	 	  updateIR();

	 	  int array_lit_amount = 0;
	 	  for (int i = 0; i < IR_ARRAY_LENGTH; i++)
	 	  {
	 		  array_lit_amount += digital_IR[i];
	 	  }

	 	  int left_sum =  4400  * digital_IR[0] + 4000 * digital_IR[1] + 3600 * digital_IR[2] + 3200 * digital_IR[3] + 2980  * digital_IR[4] + 1096 * digital_IR[5] + 403 * digital_IR[6] + 148 * digital_IR[7] + 54 * digital_IR[8] + 20 * digital_IR[9] + 8  * digital_IR[10] + 3 * digital_IR[11];
	 	  int right_sum = 3  * digital_IR[13] + 8 * digital_IR[14] + 20 * digital_IR[15] + 54 * digital_IR[16] + 148  * digital_IR[17] + 403 * digital_IR[18] + 1096 * digital_IR[19] + 2980 * digital_IR[20] + 3200 * digital_IR[21] + 3600 * digital_IR[22] + 4000 * digital_IR[23] + 4400 * digital_IR[24];


	 	  int position =  right_sum  - left_sum ;


	 	  int derivative = position - prevError;

	 	  float PID_constant = Kp * position + Kd * derivative;

	 	  prevError = position;

	 	  Drive_constant = 400;

	 	  float offset = 0; // For correcting motor speeds
	 	  int Left_drive = Drive_constant + offset  - PID_constant;
	 	  int Right_drive = Drive_constant - offset + PID_constant;
	 	  pid_sum = Left_drive;
	 	 pid_sum1 = PID_constant;
	 	  const int MIN_VALUE = -1024;
	 	  const int MAX_VALUE = 1024;

	 	  if (Left_drive < MIN_VALUE) {
	 		  Left_drive = MIN_VALUE;
	 	  } else if (Left_drive > MAX_VALUE) {
	 		  Left_drive = MAX_VALUE;
	 	  }

	 	  if (Right_drive < MIN_VALUE) {
	 		  Right_drive = MIN_VALUE;
	 	  } else if (Right_drive > MAX_VALUE) {
	 		  Right_drive = MAX_VALUE;
	 	  }

	 	  if(Right_drive < 0){
	 		  motor(right, Backward);
	 	  } else {
	 		  motor(right, Forward);
	 	  }


	 	  if(Left_drive < 0){
	 		  motor(left, Backward);
	 	  } else {
	 		  motor(left, Forward);
	 	  }


	 	  speed(Left_drive, Right_drive);
//	 	 speed(500, 500);
	 //	 servo_sweep();
	 //
	 //	 // Read color data
	 //	 TCS3472_Read_Color_Data(&hi2c2, &clear, &red, &green, &blue);
	 //
	 //	 // Use the color data as needed
	 //	 // Example: Print the values
	 //	 printf("Clear: %u, Red: %u, Green: %u, Blue: %u\n", clear, red, green, blue);
	 //
	 //	 // Delay or perform other operations
	 //	 HAL_Delay(1000); // Delay for 1 second



  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 12;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = DISABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_10;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_112CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

