DinethraDivanjana2001/TechBots-STM-based-Bot-Working/STM32 firmware/SLRC ROBOT/Core/Src/main.c
  /*Configure GPIO pins : TOF_INT_5_Pin TOF_INT_4_Pin TOF_INT_3_Pin */
  GPIO_InitStruct.Pin = TOF_INT_5_Pin|TOF_INT_4_Pin|TOF_INT_3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : TOF_LPIN_2_Pin CLR_LED_1_Pin FR_ARRAY_ODD_Pin */
  GPIO_InitStruct.Pin = TOF_LPIN_2_Pin|CLR_LED_1_Pin|FR_ARRAY_ODD_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM6) {
    millis_counter++;
  }
}

uint32_t millis() {
  return millis_counter;
}

void speed(int Left, int Right){
	  __HAL_TIM_SET_COMPARE(&htim1,FR_MOTOR_PWM,Right);
	  __HAL_TIM_SET_COMPARE(&htim1,RR_MOTOR_PWM,Left);
}

void motor(int motor,int direction){
	if (motor == 0){
		if (direction == 1){
			HAL_GPIO_WritePin(RR_INB_GPIO_Port, RR_INB_Pin, 1);
			HAL_GPIO_WritePin(RR_INA_GPIO_Port, RR_INA_Pin, 0);
		}else{
			HAL_GPIO_WritePin(RR_INB_GPIO_Port, RR_INB_Pin, 0);
			HAL_GPIO_WritePin(RR_INA_GPIO_Port, RR_INA_Pin, 1);
		}
	}else{
		if (direction == 1){
			HAL_GPIO_WritePin(FR_INB_GPIO_Port, FR_INB_Pin, 0);
			HAL_GPIO_WritePin(FR_INA_GPIO_Port, FR_INA_Pin, 1);
		}else{
			HAL_GPIO_WritePin(FR_INB_GPIO_Port, FR_INB_Pin, 1);
			HAL_GPIO_WritePin(FR_INA_GPIO_Port, FR_INA_Pin, 0);
		}
	}
}

void updateIR(){
	  // loop through amount of leds. ARRAY STARTS FROM 1
	   HAL_GPIO_WritePin(FR_ARRAY_EVEN_GPIO_Port, FR_ARRAY_EVEN_Pin, GPIO_PIN_SET);
	 	HAL_GPIO_WritePin(FR_ARRAY_ODD_GPIO_Port, FR_ARRAY_ODD_Pin, GPIO_PIN_SET);
	  for (int i = 0; i < 25; i=i+2) {
		  array_no = i;
			FR_Array_Mux_In_Select(i+1);
		  if(i <= 15){
	  		  	adc1ConfigPrivate.Channel = ADC_CHANNEL_10;
	  		  	HAL_ADC_ConfigChannel(&hadc1, &adc1ConfigPrivate);
	  		    HAL_ADC_Start(&hadc1);
	  		    HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY);
//	  		    raw = HAL_ADC_GetValue(&hadc1);
	  		    IR_array[i] = HAL_ADC_GetValue(&hadc1);
//		  			delay_us(2);

		  }else{
			adc2ConfigPrivate.Channel = ADC_CHANNEL_11;
	  		  	HAL_ADC_ConfigChannel(&hadc2, &adc2ConfigPrivate);
	  		    HAL_ADC_Start(&hadc2);
	  		    HAL_ADC_PollForConversion(&hadc2, HAL_MAX_DELAY);
//	  		    raw = HAL_ADC_GetValue(&hadc2);
	  		    IR_array[i] = HAL_ADC_GetValue(&hadc2);
//		  			delay_us(2);
		  }
		  digital_IR[i] = IR_array[i] < Ir_thresholds[i];
		  HAL_Delay(1);
	  }
	  for (int i = 1; i < 25; i=i+2) {
		  array_no = i;
			FR_Array_Mux_In_Select(i+1);
		  if(i <= 15){
	  		  	adc1ConfigPrivate.Channel = ADC_CHANNEL_10;
	  		  	HAL_ADC_ConfigChannel(&hadc1, &adc1ConfigPrivate);
	  		    HAL_ADC_Start(&hadc1);
	  		    HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY);
//	  		    raw = HAL_ADC_GetValue(&hadc1);
	  		    IR_array[i] = HAL_ADC_GetValue(&hadc1);
//		  			delay_us(2);
		  }else{
			adc2ConfigPrivate.Channel = ADC_CHANNEL_11;
	  		  	HAL_ADC_ConfigChannel(&hadc2, &adc2ConfigPrivate);
	  		    HAL_ADC_Start(&hadc2);
	  		    HAL_ADC_PollForConversion(&hadc2, HAL_MAX_DELAY);
//	  		    raw = HAL_ADC_GetValue(&hadc2);
	  		    IR_array[i] = HAL_ADC_GetValue(&hadc2);
//		  			delay_us(2);

		  }
		  digital_IR[i] = IR_array[i] < Ir_thresholds[i];
		  HAL_Delay(1);
	  }
}


void FR_Array_Mux_In_Select(int IR_LED_Num){
	if(IR_LED_Num <= 16){
	    HAL_GPIO_WritePin(FR_ARRAY_SA0_GPIO_Port, FR_ARRAY_SA0_Pin, FR_IR_LED_ARR[IR_LED_Num-1][4]);
	    HAL_GPIO_WritePin(FR_ARRAY_SA1_GPIO_Port, FR_ARRAY_SA1_Pin, FR_IR_LED_ARR[IR_LED_Num-1][3]);
	    HAL_GPIO_WritePin(FR_ARRAY_SA2_GPIO_Port, FR_ARRAY_SA2_Pin, FR_IR_LED_ARR[IR_LED_Num-1][2]);
	    HAL_GPIO_WritePin(FR_ARRAY_SA3_GPIO_Port, FR_ARRAY_SA3_Pin, FR_IR_LED_ARR[IR_LED_Num-1][1]);
	}	if(IR_LED_Num > 16){
	    HAL_GPIO_WritePin(FR_ARRAY_SB0_GPIO_Port, FR_ARRAY_SB0_Pin, FR_IR_LED_ARR[IR_LED_Num-1][4]);
	    HAL_GPIO_WritePin(FR_ARRAY_SB1_GPIO_Port, FR_ARRAY_SB1_Pin, FR_IR_LED_ARR[IR_LED_Num-1][3]);
	    HAL_GPIO_WritePin(FR_ARRAY_SB2_GPIO_Port, FR_ARRAY_SB2_Pin, FR_IR_LED_ARR[IR_LED_Num-1][2]);
	    HAL_GPIO_WritePin(FR_ARRAY_SB3_GPIO_Port, FR_ARRAY_SB3_Pin, FR_IR_LED_ARR[IR_LED_Num-1][1]);
	}

}

void calibrate()
{

//  motor(right, Backward);
//  motor(left, Forward);
//
//  // Stop motors when calibrating
//  speed(255, 255);

  // make sensor_max_values array of length IR_ARRAY_LENGTH equal to sensor calibration array
  int sensor_max_values[IR_ARRAY_LENGTH] = {0};

  // sensor min values array
  int sensor_min_values[IR_ARRAY_LENGTH] = {0};

  int now_time_for_calibration = millis();

  while (millis() - now_time_for_calibration < 5)
  {

    updateIR();
    uint8_t allZeros = 1;
    for (int i = 0; i < IR_ARRAY_LENGTH; i++)
    {
      if (sensor_max_values[i] != 0)
      {
        allZeros = 0;
        break; // No need to continue checking if we find a non-zero value
      }
    }

    if (allZeros)
    {
      for (int i = 0; i < IR_ARRAY_LENGTH; i++)
      {
        sensor_max_values[i] = IR_array[i];
        sensor_min_values[i] = IR_array[i];
      }
    }

    for (int i = 0; i < IR_ARRAY_LENGTH; i++)
    {
      if (IR_array[i] > sensor_max_values[i])
      {
        sensor_max_values[i] = IR_array[i];
      }
      if (IR_array[i] < sensor_min_values[i])
      {
        sensor_min_values[i] = IR_array[i];
      }
    }
  }

  speed(0, 0);

  for (int i = 0; i < IR_ARRAY_LENGTH; i++)
  {
    Ir_thresholds[i] = (sensor_max_values[i] + sensor_min_values[i]) / 2;
  }

}

//// EXTI line 1 interrupt handler
//void EXTI0_IRQHandler(void) {
//    // Your code here
//    // This code will be executed when the interrupt occurs
//    // Handle the interrupt (e.g., clear the interrupt flag)
//    HAL_GPIO_EXTI_IRQHandler(CLR_INT_2_Pin); // Assuming GPIO_PIN_1 is the pin associated with EXTI line 1
//}

void servo_sweep(void){
	int x;
	  for(x=1400; x<7000; x=x+1)
	  {
		__HAL_TIM_SET_COMPARE(&htim8,TIM_CHANNEL_1, x);
		HAL_Delay(3);
	  }

	  for(x=1400; x<7000; x=x+1)
	  {
		__HAL_TIM_SET_COMPARE(&htim8,TIM_CHANNEL_2, x);
		HAL_Delay(3);
	  }

	  for(x=1400; x<7000; x=x+1)
	  {
		__HAL_TIM_SET_COMPARE(&htim8,TIM_CHANNEL_3, x);
		HAL_Delay(3);
	  }

	  for(x=1400; x<7000; x=x+1)
	  {
		__HAL_TIM_SET_COMPARE(&htim8,TIM_CHANNEL_4, x);
		HAL_Delay(3);
	  }
}

//// Function to initialize TCS3472
//void TCS3472_Init(I2C_HandleTypeDef *hi2c) {
//    // Example initialization steps
//    // Write to the command register to set up the device
//    // You may need to set integration time, wait time, etc.
//    // Refer to the datasheet for initialization details
//}
//
//// Function to read color data from TCS3472
//void TCS3472_Read_Color_Data(I2C_HandleTypeDef *hi2c, uint16_t *clear, uint16_t *red, uint16_t *green, uint16_t *blue) {
//    // Write to the command register to select the desired register for reading color data
//    // For example, to read clear data, you need to write the command register with 0x14 address
//    uint8_t command = 0x14;
//    HAL_I2C_Master_Transmit(hi2c, TCS3472_ADDRESS << 1, &command, 1, HAL_MAX_DELAY);
//
//    // Read color data
//    uint8_t data[8]; // Assuming each color data is 2 bytes
//    HAL_I2C_Master_Receive(hi2c, TCS3472_ADDRESS << 1, data, 8, HAL_MAX_DELAY);
//
//    // Extract color data from received data
//    *clear = (data[1] << 8) | data[0]; // Assuming clear data is in register 0x14
//    *red = (data[3] << 8) | data[2];   // Assuming red data is in register 0x16
//    *green = (data[5] << 8) | data[4]; // Assuming green data is in register 0x18
//    *blue = (data[7] << 8) | data[6];  // Assuming blue data is in register 0x1A
//}



//int computeSum(int side, int* IR_ARRAY, int* CONSTANT_ARRAY) {
//	if(side == "RH"){
//	    int sum = 0;
//	    for (int i = 0; i < CONSTANT_ARRAY_LENGTH; ++i) {
//	        sum += IR_ARRAY[i] * CONSTANT_ARRAY[i];
//	    }
//	    return sum;
//
//	}
//	else if(side == "LH"){
//	    int sum = 0;
//	    for (int i = 0; i < CONSTANT_ARRAY_LENGTH; ++i) {
//	        sum += IR_ARRAY[i+CONSTANT_ARRAY_LENGTH+1] * CONSTANT_ARRAY[i];
//	    }
//	    return sum;
//	}
//
//}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
